In [2]:
import pandas as pd

Dataframe - tabular format - rows and columns

In [3]:
#dataframe using list
list1=[33,55,66,22,12,44,67]
df=pd.DataFrame(list1)
print(df)

    0
0  33
1  55
2  66
3  22
4  12
5  44
6  67

In [4]:
#dataframe using dictionary of list
details = { 
    'Name' : ['Ankit', 'Aishwarya', 'Shaurya', 'Shivangi'], 
    'Age' : [23, 21, 22, 21], 
    'University' : ['BHU', 'JNU', 'DU', 'BHU'], 
} 
df=pd.DataFrame(details)
print(df)

        Name  Age University
0      Ankit   23        BHU
1  Aishwarya   21        JNU
2    Shaurya   22         DU
3   Shivangi   21        BHU

In [7]:
# Python code demonstrate how to create
# Pandas DataFrame by lists of dicts

# Initialize data to lists.
data = [{'a': 1, 'b': 2, 'c': 3},
 {'a': 10, 'b': 20, 'c': 30},
  {'a': 100, 'b': 200, 'c': 300}]

# Creates DataFrame.
#df=pd.DataFrame(data)
df = pd.DataFrame(data, index=['First Row','Second Row','Third Row'] )

# Print the data
df

              a    b    c
First Row     1    2    3
Second Row   10   20   30
Third Row   100  200  300

In [38]:
rd = df.loc['Second Row']
rd

a    10
b    20
c    30
Name: Second Row, dtype: int64

In [39]:
dict = {"Name": ["Anush Sharma", "Balareddy", "Chintu", "Eshwari", "Fathima"],
       "Occupation": ["Rocket Scientist", "Rocket Scientist", "Lawyer", "Data Scientist", "Rocket Scientist"],
       "ID": [1, 2, 3, 4, 5]}

df = pd.DataFrame(dict)
print(df)

print(df['Occupation'] == 'Rocket Scientist')

           Name        Occupation  ID
0  Anush Sharma  Rocket Scientist   1
1     Balareddy  Rocket Scientist   2
2        Chintu            Lawyer   3
3       Eshwari    Data Scientist   4
4       Fathima  Rocket Scientist   5
0     True
1     True
2    False
3    False
4     True
Name: Occupation, dtype: bool

In [7]:
myjson='[{"id":"101","Name":"Neha","age":"33"},{"id":"102","Name":"Nootan","age":"30"}]'
df3 =pd.read_json(myjson)
print(df3)

    id    Name  age
0  101    Neha   33
1  102  Nootan   30

C:\Users\n.vinodrai.padia\AppData\Local\Temp\ipykernel_12748\2451742793.py:2: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  df3 =pd.read_json(myjson)

In [8]:
import json
from pandas import json_normalize
myjson='[{"id":"101","Name":"Neha","age":"33"},{"id":"102","Name":"Nootan","age":"30"}]'
dict1 = json.loads(myjson)
df3 =json_normalize(dict1)
print(df3)

    id    Name age
0  101    Neha  33
1  102  Nootan  30

In [10]:
#df=pd.read_csv("dataset/emp1.csv",header=None)
df=pd.read_csv("dataset/emp1.csv",header=None,names=['name','desig','post'])
print(df)

     name    desig            post
0  nootan  trainer  senior analyst
1    neha   tester       Team Lead

In [45]:
df=pd.read_csv("dataset/emp.csv")
print(df)

   eno ename  salary
0    1    nn   20000
1    2    mm   30000

In [46]:
print(df)
print("\n",df.shape)
print("\n",df.size)
print("\n",df.dtypes)
print("\n",df.axes)

   eno ename  salary
0    1    nn   20000
1    2    mm   30000

 (2, 3)

 6

 eno        int64
ename     object
salary     int64
dtype: object

 [RangeIndex(start=0, stop=2, step=1), Index(['eno', 'ename', 'salary'], dtype='object')]

In [48]:
sortdf=df.sort_index(ascending=False)
print('_________________')
print(sortdf)

print('---------------------------------------')
newsort=df.sort_values(by='salary',ascending=False)
print(newsort)

_________________
   eno ename  salary
1    2    mm   30000
0    1    nn   20000
---------------------------------------
   eno ename  salary
1    2    mm   30000
0    1    nn   20000

In [13]:
import pandas as pd
df = pd.read_excel('dataset/emp2.xlsx',sheet_name='Employees')
print(df)

ValueError: Worksheet named 'Employees' not found

In [50]:
import pandas as pd
df = pd.read_excel('dataset/emp2.xlsx',sheet_name='employees')
print(df)

   eno    name    desig
0    1  nootan  trainer
1    2    neha   tester

In [15]:
print(df.eno)
print("\n",df["eno"])
print("\n",df.loc[0:2])
print("\n",df[["eno","name"]])

0    1
1    2
Name: eno, dtype: int64

 0    1
1    2
Name: eno, dtype: int64

    eno    name    desig
0    1  nootan  trainer
1    2    neha   tester

    eno    name
0    1  nootan
1    2    neha

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eno     2 non-null      int64
 1   name    2 non-null      object
 2   desig   2 non-null      object
dtypes: int64(1), object(2)
memory usage: 180.0+ bytes

In [51]:
df.to_excel("c:\\data\\data2.xlsx",index=None)

In [12]:
df1 = pd.read_csv("dataset/missing_value.csv")
df1.head(10) #by default first 5 rows will be displayed

   cno name  product ranking
0    1    A  shampoo       5
1    2    B  shampoo       4
2    3    C  shampoo     NaN
3    4    D  shampoo     NaN
4    5    E  shampoo       7
5    6    F  shampoo       8
6    7    A  shampoo       5
7    8    G    sugar     not
8    9    A    sugar      na
9   10    B    sugar       7

In [13]:
df1.tail(10) #by default, it will display last 5 rows

    cno name  product ranking
5     6    F  shampoo       8
6     7    A  shampoo       5
7     8    G    sugar     not
8     9    A    sugar      na
9    10    B    sugar       7
10   11    C    sugar       2
11   12    A     salt     NaN
12   13    B     salt       6
13   14    D     salt       7
14   15    D     salt     NaN

In [14]:
df1.isnull()

      cno   name  product  ranking
0   False  False    False    False
1   False  False    False    False
2   False  False    False     True
3   False  False    False     True
4   False  False    False    False
5   False  False    False    False
6   False  False    False    False
7   False  False    False    False
8   False  False    False    False
9   False  False    False    False
10  False  False    False    False
11  False  False    False     True
12  False  False    False    False
13  False  False    False    False
14  False  False    False     True

In [15]:
df1.head(10)

   cno name  product ranking
0    1    A  shampoo       5
1    2    B  shampoo       4
2    3    C  shampoo     NaN
3    4    D  shampoo     NaN
4    5    E  shampoo       7
5    6    F  shampoo       8
6    7    A  shampoo       5
7    8    G    sugar     not
8    9    A    sugar      na
9   10    B    sugar       7

In [16]:
df1.isnull().sum()

cno        0
name       0
product    0
ranking    4
dtype: int64

In [18]:
df1['ranking'].unique()

array(['5', '4', nan, '7', '8', 'not', 'na', '2', '6'], dtype=object)

In [17]:
df1.describe() #statistical summary

             cno
count  15.000000
mean    8.000000
std     4.472136
min     1.000000
25%     4.500000
50%     8.000000
75%    11.500000
max    15.000000

In [24]:
m=df1['ranking'].mean()
m
df1=df1.fillna(m)
df1

    cno name  product   ranking
0     1    A  shampoo  5.000000
1     2    B  shampoo  4.000000
2     3    C  shampoo  5.666667
3     4    D  shampoo  5.666667
4     5    E  shampoo  7.000000
5     6    F  shampoo  8.000000
6     7    A  shampoo  5.000000
7     8    G    sugar  5.666667
8     9    A    sugar  5.666667
9    10    B    sugar  7.000000
10   11    C    sugar  2.000000
11   12    A     salt  5.666667
12   13    B     salt  6.000000
13   14    D     salt  7.000000
14   15    D     salt  5.666667

In [19]:
df2=pd.read_csv('dataset/missing_value.csv',na_values=['not','na'])
df2

    cno name  product  ranking
0     1    A  shampoo      5.0
1     2    B  shampoo      4.0
2     3    C  shampoo      NaN
3     4    D  shampoo      NaN
4     5    E  shampoo      7.0
5     6    F  shampoo      8.0
6     7    A  shampoo      5.0
7     8    G    sugar      NaN
8     9    A    sugar      NaN
9    10    B    sugar      7.0
10   11    C    sugar      2.0
11   12    A     salt      NaN
12   13    B     salt      6.0
13   14    D     salt      7.0
14   15    D     salt      NaN

In [20]:
df2.isnull().sum()

cno        0
name       0
product    0
ranking    6
dtype: int64

In [21]:
df2['ranking'].unique()

array([ 5.,  4., nan,  7.,  8.,  2.,  6.])

In [22]:
df2.dropna(axis=0,inplace=True) #remove rows in which null - default
df2

    cno name  product  ranking
0     1    A  shampoo      5.0
1     2    B  shampoo      4.0
4     5    E  shampoo      7.0
5     6    F  shampoo      8.0
6     7    A  shampoo      5.0
9    10    B    sugar      7.0
10   11    C    sugar      2.0
12   13    B     salt      6.0
13   14    D     salt      7.0

In [74]:
df5 = df2['product'].drop_duplicates()
df5

0     shampoo
7       sugar
11       salt
Name: product, dtype: object

In [83]:
df2.rename(columns={'product':'items'},inplace=True)
df2

    cno name    items  ranking
0     1    A  shampoo      5.0
1     2    B  shampoo      4.0
4     5    E  shampoo      7.0
5     6    F  shampoo      8.0
6     7    A  shampoo      5.0
9    10    B    sugar      7.0
10   11    C    sugar      2.0
12   13    B     salt      6.0
13   14    D     salt      7.0

In [29]:
filtered_df = df2['items']=='shampoo'
filtered_df

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
Name: items, dtype: bool

In [30]:
filtered_df = (df2['items']=='shampoo') & (df2['name']=='A')
filtered_df

0      True
1     False
2     False
3     False
4     False
5     False
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
dtype: bool

In [84]:
df2.sort_values(by='items',ascending=False)

    cno name    items  ranking
9    10    B    sugar      7.0
10   11    C    sugar      2.0
0     1    A  shampoo      5.0
1     2    B  shampoo      4.0
4     5    E  shampoo      7.0
5     6    F  shampoo      8.0
6     7    A  shampoo      5.0
12   13    B     salt      6.0
13   14    D     salt      7.0

In [85]:
df2.to_csv('c:/data/output.csv')